felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
            <register>
                <name>PSARC</name>
                <description>Peripheral Security Attribution Register C</description>
                <addressOffset>0x08</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0xffffffff</resetValue>
                <resetMask>0xffffffff</resetMask>
                <fields>
                    <field>
                        <name>PSARC0</name>
                        <description>CAC and the MSTPCRC.MSTPC0 bit security attribution</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC1</name>
                        <description>CRC and the MSTPCRC.MSTPC1 bit security attribution</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC3</name>
                        <description>CTSU and the MSTPCRC.MSTPC3 bit security attribution</description>
                        <lsb>3</lsb>
                        <msb>3</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC8</name>
                        <description>SSIE0 and the MSTPCRC.MSTPC8 bit security attribution</description>
                        <lsb>8</lsb>
                        <msb>8</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC12</name>
                        <description>SDHI0 and the MSTPCRC.MSTPC12 bit security attribution</description>
                        <lsb>12</lsb>
                        <msb>12</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC13</name>
                        <description>DOC and the MSTPCRC.MSTPC13 bit security attribution</description>
                        <lsb>13</lsb>
                        <msb>13</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC26</name>
                        <description>CANFD1 and the MSTPCRC.MSTPC26 bit security attribution</description>
                        <lsb>26</lsb>
                        <msb>26</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC27</name>
                        <description>CANFD0 and the MSTPCRC.MSTPC27 bit security attribution</description>
                        <lsb>27</lsb>
                        <msb>27</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARC31</name>
                        <description>TSIP and the MSTPCRC.MSTPC31 bit security attribution</description>
                        <lsb>31</lsb>
                        <msb>31</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>PSARD</name>
                <description>Peripheral Security Attribution Register D</description>
                <addressOffset>0x0C</addressOffset>
                <size>32</size>
                <access>read-write</access>
                <resetValue>0xffffffff</resetValue>
                <resetMask>0xffffffff</resetMask>
                <fields>
                    <field>
                        <name>PSARD0</name>
                        <description>AGT3 and the MSTPCRD.MSTPD0 bit security attribution</description>
                        <lsb>0</lsb>
                        <msb>0</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD1</name>
                        <description>AGT2 and the MSTPCRD.MSTPD1 bit security attribution</description>
                        <lsb>1</lsb>
                        <msb>1</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD2</name>
                        <description>AGT1 and the MSTPCRD.MSTPD2 bit security attribution</description>
                        <lsb>2</lsb>
                        <msb>2</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD3</name>
                        <description>AGT0 and the MSTPCRD.MSTPD3 bit security attribution</description>
                        <lsb>3</lsb>
                        <msb>3</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD11</name>
                        <description>PGI3 and the MSTPCRD.MSTPD11 bit security attribution</description>
                        <lsb>11</lsb>
                        <msb>11</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD12</name>
                        <description>PGI2 and the MSTPCRD.MSTPD12 bit security attribution</description>
                        <lsb>12</lsb>
                        <msb>12</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD13</name>
                        <description>PGI1 and the MSTPCRD.MSTPD13 bit security attribution</description>
                        <lsb>13</lsb>
                        <msb>13</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD14</name>
                        <description>PGI0 and the MSTPCRD.MSTPD14 bit security attribution</description>
                        <lsb>14</lsb>
                        <msb>14</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD15</name>
                        <description>ADC1 and the MSTPCRD.MSTPD15 bit security attribution</description>
                        <lsb>15</lsb>
                        <msb>15</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD16</name>
                        <description>ADC0 and the MSTPCRD.MSTPD16 bit security attribution</description>
                        <lsb>16</lsb>
                        <msb>16</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD20</name>
                        <description>DAC12 and the MSTPCRD.MSTPD20 bit security attribution</description>
                        <lsb>20</lsb>
                        <msb>20</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSARD22</name>
                        <description>TSN and the MSTPCRD.MSTPD22 bit security attribution</description>
                        <lsb>22</lsb>
                        <msb>22</msb>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>0</name>
                                <description>Secure</description>
                                <value>#0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1</name>
                                <description>Non-secure</description>
                                <value>#1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
