felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_ETHERC_EPTPC</name>
      <description>Ethernet PTP Controller</description>
      <baseAddress>0x40065800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x010</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000040</offset>
        <size>0x008</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000050</offset>
        <size>0x01C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000080</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000090</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000A0</offset>
        <size>0x00C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000C0</offset>
        <size>0x018</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000000E0</offset>
        <size>0x018</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000100</offset>
        <size>0x014</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000120</offset>
        <size>0x024</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000160</offset>
        <size>0x018</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x000001C0</offset>
        <size>0x018</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>F[%s]</name>
          <description>Frame Reception Filter Setting Registers</description>
          <addressOffset>0x160</addressOffset>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>0-1</dimIndex>
            <name>MACRU</name>
            <description>Frame Reception Filter MAC Address Setting Registers</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FMACRU</name>
                <description>These bits hold the setting for the higher-order 24 bits of the destination MAC address for received multicast frames.</description>
                <lsb>0</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>0-1</dimIndex>
            <name>MACRL</name>
            <description>Frame Reception Filter MAC Address Setting Registers</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FMACRL</name>
                <description>These bits hold the setting for the lower-order 24 bits of the destination MAC address for received multicast frames.</description>
                <lsb>0</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SYSR</name>
          <description>SYNFP Status Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENDN</name>
              <description>Generation Stop Completion Detection Flag</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stopping generation has not been completed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Stopping generation has been completed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESDN</name>
              <description>Response Stop Completion Detection Flag</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stopping responses has not been completed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Stopping responses has been completed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INFABT</name>
              <description>Control Information Abnormality Detection Flag</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No abnormality in control information</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Abnormality in control information</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECLP</name>
              <description>Loop Reception Detection Flag</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A received message has not returned through a loop.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A received message has returned through a loop.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRQOVR</name>
              <description>Delay_Req Reception FIFO Overflow Detection Flag</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The received Delay_Req has not caused the reception FIFO to overflow.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The received Delay_Req has caused the reception FIFO to overflow.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTDEV</name>
              <description>Receive logMessageInterval Value Out-of-Range Flag</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The received logMessageInterval value is within the range.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The received logMessageInterval value is out of the range.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRPTO</name>
              <description>Delay_Resp/Pdelay_Resp Reception Timeout Detection Flag</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A Delay_Resp/Pdelay_Resp timeout has not occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A Delay_Resp/Pdelay_Resp timeout has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPDUD</name>
              <description>meanPathDelay Value Update Flag</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The meanPathDelay value has not been updated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The meanPathDelay value has been updated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTCHG</name>
              <description>Receive logMessageInterval Value Change Detection Flag</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No change in the received logMessageInterval value.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A change in the received logMessageInterval value.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFMUD</name>
              <description>offsetFromMaster Value Update Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The offsetFromMaster value has not been updated.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The offsetFromMaster value has been updated.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYIPR</name>
          <description>SYNFP Status Notification Permission Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENDN</name>
              <description>SYSR.GENDN Status Notification Permission</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.GENDN.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.GENDN.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESDN</name>
              <description>SYSR.RESDN Status Notification Permission</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.RESDN.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.RESDN.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INFABT</name>
              <description>SYSR.INFABT Status Notification Permission</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.INFABT.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.INFABT.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECLP</name>
              <description>SYSR.RECLP Status Notification Permission</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.RECLP.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.RECLP.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRQOVR</name>
              <description>SYSR.DRQOVR Status Notification Permission</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.DRQOVR.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.DRQOVR.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTDEV</name>
              <description>SYSR.INTDEV Status Notification Permission</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.INTDEV.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.INTDEV.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRPTO</name>
              <description>SYSR.DRPTO Status Notification Permission</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.DRPTO.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.DRPTO.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPDUD</name>
              <description>SYSR.MPDUD Status Notification Permission</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.MPDUD.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.MPDUD.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTCHG</name>
              <description>SYSR.INTCHG Status Notification Permission</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.INTCHG.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.INTCHG.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFMUD</name>
              <description>SYSR.OFMUD Status Notification Permission</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of SYSR.OFMUD.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of SYSR.OFMUD.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYMACRU</name>
          <description>SYNFP MAC Address Registers</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYMACRU</name>
              <description>These bits hold the setting for the higher-order 24 bits of the local MAC address.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYMACRL</name>
          <description>SYNFP MAC Address Registers</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYMACRL</name>
              <description>These bits hold the setting for the lower-order 24 bits of the local MAC address.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYLLCCTLR</name>
          <description>SYNFP LLC-CTL Value Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTL</name>
              <description>LLC-CTL FieldThese bits specify the value used for the control field in the LLC sublayer when generating IEEE802.3 frames.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
