felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>TMSTARTR</name>
          <description>Timer Start Register</description>
          <addressOffset>0x37C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN5</name>
              <description>Pulse Output Timer 5 Start</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stops pulse output timer 5.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts pulse output timer 5.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN4</name>
              <description>Pulse Output Timer 4 Start</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stops pulse output timer 4.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts pulse output timer 4.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN3</name>
              <description>Pulse Output Timer 3 Start</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stops pulse output timer 3.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts pulse output timer 3.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN2</name>
              <description>Pulse Output Timer 2 Start</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stops pulse output timer 2.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts pulse output timer 2.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN1</name>
              <description>Pulse Output Timer 1 Start</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stops pulse output timer 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts pulse output timer 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN0</name>
              <description>Pulse Output Timer 0 Start</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Stops pulse output timer 0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Starts pulse output timer 0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSR</name>
          <description>PRC-TC Status Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>URE1</name>
              <description>Relay Packet Underflow Detection Flag 1</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No underflow in transfer of data from SYNFP0 to SYNFP1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An underflow has been detected in transfer of data from SYNFP0 to SYNFP1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>URE0</name>
              <description>Relay Packet Underflow Detection Flag 0</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No underflow in transfer of data from SYNFP1 to SYNFP0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An underflow has been detected in transfer of data from SYNFP1 to SYNFP0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACE</name>
              <description>Originating MAC Address Mismatch Detection Flag</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A MAC address mismatch has not been detected.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A MAC address mismatch has been detected.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE3</name>
              <description>Relay Packet Overflow Detection Flag 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overflow in transfer of data from SYNFP0 to SYNFP1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An overflow has been detected in transfer of data from SYNFP0 to SYNFP1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE2</name>
              <description>Relay Packet Overflow Detection Flag 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overflow in transfer of data from SYNFP1 to SYNFP0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An overflow has been detected in transfer of data from SYNFP1 to SYNFP0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE1</name>
              <description>Relay Packet Overflow Detection Flag 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overflow in transfer of data from SYNFP0 to PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An overflow has been detected in transfer of data from SYNFP0 to PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE0</name>
              <description>Relay Packet Overflow Detection Flag 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No overflow in transfer of data from SYNFP1 to PTPEDMAC.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>An overflow has been detected in transfer of data from SYNFP1 to PTPEDMAC.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIPR</name>
          <description>PRC-TC Status Notification Permission Register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>URE1</name>
              <description>PRSR.URE1 Status Notification Permission</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of PRSR.URE1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of PRSR.URE1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>URE0</name>
              <description>PRSR.URE0 Status Notification Permission</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of PRSR.URE0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of PRSR.URE0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MACE</name>
              <description>PRSR.MACE Status Notification Permission</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of PRSR.MACE</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of PRSR.MACE</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE3</name>
              <description>PRSR.OVRE3 Status Notification Permission</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of PRSR.OVRE3.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of PRSR.OVRE3.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE2</name>
              <description>PRSR.OVRE2 Status Notification Permission</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of PRSR.OVRE2.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of PRSR.OVRE2.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE1</name>
              <description>PRSR.OVRE1 Status Notification Permission</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of PRSR.OVRE1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of PRSR.OVRE1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRE0</name>
              <description>PRSR.OVRE0 Status Notification Permission</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Prohibits notification of the state of PRSR.OVRE0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Permits notification of the state of PRSR.OVRE0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNDISR</name>
          <description>Packet Transmission Control Register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDIS</name>
              <description>Packet Transmission Control</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>PTP packets are transmitted through both Ethernet port 0 and Ethernet port 1.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>PTP packets are only transmitted through Ethernet port 0.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>PTP packets are only transmitted through Ethernet port 1.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Setting prohibited</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNMR</name>
          <description>Relay Mode Register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FWD1</name>
              <description>Channel 1 Relay Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Unicast, multicast (other than PTP packets), and broadcast messages from the other node are not relayed from port 1 to port 0.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Unicast, multicast (other than PTP packets), and broadcast messages from the other node are relayed from port 1 to port 0.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWD0</name>
              <description>Channel 0 Relay Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Unicast, multicast (other than PTP packets), and broadcast messages from the other node are not relayed from port 0 to port 1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Unicast, multicast (other than PTP packets), and broadcast messages from the other node are relayed from port 0 to port 1.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOD</name>
              <description>Cut-Through Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Store-and-forward</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Cut-through</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNCTTDR</name>
          <description>Cut-Through Transfer Start Threshold Register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THVAL</name>
              <description>FIFO Read Start ThresholdThreshold for starting to read data from the relay FIFO in cut-through mode (specified as the number of bytes)NOTE1: A value cannot be set in the lower-order 2 bits. These bits are fixed to 0.NOTE2: A value of less than 96 bytes cannot be set.</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
