felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
          <register>
            <name>MON</name>
            <description>Background Plane Setting Status Monitor Register</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SWRST</name>
                <description>Entire module SW reset state monitor.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>The entire module is released from the SW reset state.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>The entire module is in the SW reset state.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VEN</name>
                <description>
									Entire module internal operation reflection control signal monitor.
									The signal  state for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal.
								</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>The signal for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal is asserted.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>The signal for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal is negated.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Background plane generation module operation state monitor.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Operation is in progress.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Operation is stopped.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>GR[%s]</name>
          <description>Layer Registers</description>
          <addressOffset>0x1100</addressOffset>
          <register>
            <name>VEN</name>
            <description>Graphics Register Update Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PVEN</name>
                <description>
									Control of graphics n module register value reflection to internal operations.
									Reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).
								</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <readAction>modify</readAction>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLMRD</name>
            <description>Graphics Frame Buffer Read Control Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RENB</name>
                <description>Graphics data (frame buffer data) read enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables reading.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables reading.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM1</name>
            <description>Graphics Frame Buffer Control Register 1</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000003</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BSTMD</name>
                <description>
									Burst transfer control for graphics data (frame buffer data)
									access
								</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>16-beat increment burst transfer (64-byte boundary)</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM2</name>
            <description>Graphics Frame Buffer Control Register 2</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BASE</name>
                <description>
									Base address for accessing graphics data (frame buffer data)
									Set the head address in the frame buffer where graphics data is to be stored. GRn_FLM2.BASE[5:0] should be fixed to 0 during 64-byte burst transfer.
								</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM3</name>
            <description>Graphics Frame Buffer Control Register 3</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LNOFF</name>
                <description>
									Macro line offset address for accessing graphics data
									(frame buffer data)
									Signed; 16-bit integer
								</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM5</name>
            <description>Graphics Frame Buffer Control Register 5</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LNNUM</name>
                <description>Number of lines per frame for accessing graphics data (frame buffer data).</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x00F</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LNNUM</name>
                    <description>LNNUM lines.  The valid range is 0x00F to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DATANUM</name>
                <description>Number of data transfer times per line for accessing graphics data (frame buffer data), where one transfer is defined as 16-beat burst access (64-byte boundary)</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DATAUM</name>
                    <description>DATAUM+1 times.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLM6</name>
            <description>Graphics Frame Buffer Control Register 6</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FORMAT</name>
                <description>Data format for accessing graphics data (frame buffer data).</description>
                <lsb>28</lsb>
                <msb>30</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>111</name>
                    <description>CLUT11bit/pix)</description>
                    <value>#111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>CLUT4 (4 bits/pix)</description>
                    <value>#110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>CLUT8 (8 bits/pix)</description>
                    <value>#101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>ARGB8888 (32 bits/pix)</description>
                    <value>#100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>ARGB4444 (16 bits/pix)</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>ARGB1555 (16 bits/pix, 1 bit of A is LUT data)</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>RGB888 (32 bits/pix, 8 bits on the MSB side are invalid)</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>RGB565 (16 bits/pix)</description>
                    <value>#000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB1</name>
            <description>Graphics Alpha Blending Control Register 1</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCON</name>
                <description>Rectangular area alpha blending control.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>On</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Off</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCDISPON</name>
                <description>Image area border display control for rectangular area alpha blending.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Display on</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Display off</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRCDISPON</name>
                <description>Graphics image area border display control.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Display on</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Display off</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISPSEL</name>
                <description>Graphics display plane control.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Blended display of lower-layer graphics (input image from the previous stage) and current graphics (graphics data read from the AHB bus)</description>
                    <value>#11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>Current graphics display</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Lower-layer graphics display</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>00</name>
                    <description>Background color display (value set by the GRn_BASE register).</description>
                    <value>#00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB2</name>
            <description>Graphics Alpha Blending Control Register 2</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00060010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GRCVS</name>
                <description>Vertical start position of graphics image area.</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x002</minimum>
                    <maximum>0x3EE</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCVS</name>
                    <description>GRCVS lines. The valid range is 0x002 to 0x3EE. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRCVW</name>
                <description>Vertical width of graphics image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x010</minimum>
                    <maximum>0x3FC</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCVW</name>
                    <description>GRCVW lines.  The valid range is 0x010 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB3</name>
            <description>Graphics Alpha Blending Control Register 3</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00050010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GRCHS</name>
                <description>Horizontal start position of graphics image area.</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x005</minimum>
                    <maximum>0x3ED</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCHS</name>
                    <description>GRCHS lines. The valid range is 0x005 to 0x3ED. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>GRCHW</name>
                <description>Horizontal width of graphics image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x010</minimum>
                    <maximum>0x3F0</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GRCHW</name>
                    <description>GRCHW pixels. The valid range is 0x010 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
