felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
          <register>
            <name>AB4</name>
            <description>Graphics Alpha Blending Control Register 4</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00060010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCVS</name>
                <description>Vertical start position of rectangular area alpha blending image area</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x002</minimum>
                    <maximum>0x3EE</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCVS</name>
                    <description>ARCVS linels. The valid range is 0x002 to 0x3EE. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCVW</name>
                <description>Vertical width of rectangular area alpha blending image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x001</minimum>
                    <maximum>0x3FC</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCVW</name>
                    <description>ARCVW linels. The valid range is 0x001 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB5</name>
            <description>Graphics Alpha Blending Control Register 5</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00050010</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCHS</name>
                <description>Horizontal start position of rectangular area alpha blending image area.</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x005</minimum>
                    <maximum>0x3ED</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCHS</name>
                    <description>ARCHS pixel. The valid range is 0x005 to 0x3ED. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCHW</name>
                <description>Horizontal width of rectangular area alpha blending image area.</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x001</minimum>
                    <maximum>0x3F8</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCHW</name>
                    <description>ARCHW pixels. The valid range is 0x001 to 0x3F0. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB6</name>
            <description>Graphics Alpha Blending Control Register 6</description>
            <addressOffset>0x34</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCCOEF</name>
                <description>
									Alpha coefficient for alpha blending in rectangular area (-255 to 255).
									[8]: Sign (0: addition, 1: subtraction)
									[7:0]: Variation (absolute value)
								</description>
                <lsb>16</lsb>
                <msb>24</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>ARCRATE</name>
                <description>Frame rate for alpha blending in rectangular area.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ARCRATE</name>
                    <description>ARCRATE+1 frames</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB7</name>
            <description>Graphics Alpha Blending Control Register 7</description>
            <addressOffset>0x38</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ARCDEF</name>
                <description>Initial alpha value for alpha blending in rectangular area.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKON</name>
                <description>RGB-index chroma-key processing control.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables chroma-key processing</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables chroma-key processing</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>AB8</name>
            <description>Graphics Alpha Blending Control Register 8</description>
            <addressOffset>0x3C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CKKG</name>
                <description>
									G signal for RGB-index chroma-key processing
									Unsigned; 8 bits.
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKKB</name>
                <description>
									B signal for RGB-index chroma-key processing
									Unsigned; 8 bits.
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKKR</name>
                <description>
									R signal for RGB-index chroma-key processing
									Unsigned; 8 bits.
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AB9</name>
            <description>Graphics Alpha Blending Control Register 9</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CKA</name>
                <description>A value after RGB-index chroma-key processing replacement.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKG</name>
                <description>
									G value after RGB-index chroma-key processing replacement
									Unsigned; 8 bits.
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKB</name>
                <description>
									B value after RGB-index chroma-key processing replacement
									Unsigned; 8 bits.
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>CKR</name>
                <description>
									R value after RGB-index chroma-key processing replacement
									Unsigned; 8 bits.
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BASE</name>
            <description>Graphics Background Color Control Register</description>
            <addressOffset>0x4C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>G</name>
                <description>
									Background color G value
									Unsigned; 8 bits
								</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>B</name>
                <description>
									Background color B value
									Unsigned; 8 bits
								</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-write</access>
              </field>
              <field>
                <name>R</name>
                <description>
									Background color R value
									Unsigned; 8 bits
								</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLUTINT</name>
            <description>Graphics CLUT Table Interrupt Control Register</description>
            <addressOffset>0x50</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SEL</name>
                <description>CLUT table control</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Uses CLUT1 plane for internal operations.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Uses CLUT0 plane for internal operations.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Setting prohibited</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LINE</name>
                <description>Number of detection lines</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x400</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LINE</name>
                    <description>LINE+1 lines. The valid range is 0x000 to 0x400. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MON</name>
            <description>Graphics Status Monitor Register</description>
            <addressOffset>0x54</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>UNDFLST</name>
                <description>Status monitor for underflow</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>An underflow occurs in internal operations.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No underflow occurs in internal operations.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ARCST</name>
                <description>Status monitor for alpha blending in rectangular area</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Fade-in/fade-out is in progress.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Fade-in/fade-out is not in progress.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x40</dimIncrement>
          <name>GAM[%s]</name>
          <description>Gamma Settings</description>
          <addressOffset>0x1300</addressOffset>
          <register>
            <name>LATCH</name>
            <description>Gamma Register Update Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEN</name>
                <description>
									Control of gamma correction x module register value reflection to internal operations.
									The register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).
								</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <readAction>modify</readAction>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>GAM_SW</name>
            <description>Gamma Correction Block Function Switch Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>GAMON</name>
                <description>Gamma correction on/off control</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Turns on gamma correction.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Turns off gamma correction.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x04</dimIncrement>
            <name>LUT[%s]</name>
            <description>Gamma Correction Block Table Setting Register </description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <dim>2</dim>
                <dimIncrement>16</dimIncrement>
                <dimIndex>HIGH,LOW</dimIndex>
                <name>_%s</name>
                <description>
									Gain value of area 0.
									Unsigned 11-bit fixed point.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>GAIN00</name>
                    <description>GAIN00/1024</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>5</dim>
            <dimIncrement>0x04</dimIncrement>
            <name>AREA[%s]</name>
            <description>Gamma Correction Block Area Setting Register </description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <dim>3</dim>
                <dimIncrement>10</dimIncrement>
                <dimIndex>HIGH,MID,LOW</dimIndex>
                <name>_%s</name>
                <description>
									Start threshold of area 1
									Unsigned 10-bit integer
								</description>
                <lsb>0</lsb>
                <msb>9</msb>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>OUT</name>
          <description>Output Control Registers</description>
          <addressOffset>0x13C0</addressOffset>
          <register>
            <name>VLATCH</name>
            <description>Output Control Block Register Update Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VEN</name>
                <description>
									Control of output control module register value reflection to internal operations.
									The register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).
								</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <readAction>modify</readAction>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables the register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS).</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
