felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STV%s1</name>
            <description>TCON Vertical Timing Setting Register %s1</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>VS</name>
                <description>STVx1 first change timing</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x7FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VS</name>
                    <description>VS pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VW</name>
                <description>
									STVx1 second change timing
									Sets the signal assertion width.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x7FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VW</name>
                    <description>VW pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STV%s2</name>
            <description>TCON Vertical Timing Setting Register %s2</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INV</name>
                <description>STVx signal polarity inversion control </description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Inverted</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Not inverted</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEL</name>
                <description>Output signal select control for VSOUT (controlled by TCON_STVA2 register)/VEOUT (controlled by the TCON_STVB2 register) pin</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>111</name>
                    <description>DE</description>
                    <value>#111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>Setting prohibited</description>
                    <value>#110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>Setting prohibited</description>
                    <value>#101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>Setting prohibited</description>
                    <value>#100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>STHB</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>STHA</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>STVB</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>STVA</description>
                    <value>#000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STH%s1</name>
            <description>TCON Horizontal Timing Setting Register STH%s1</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HS</name>
                <description>STHx1 first change timing</description>
                <lsb>16</lsb>
                <msb>26</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HS</name>
                    <description>HS lines. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HW</name>
                <description>
									STHx1 second change timing.
									Sets the signal assertion width.
								</description>
                <lsb>0</lsb>
                <msb>10</msb>
                <access>read-write</access>
                <writeConstraint>
                  <range>
                    <minimum>0x000</minimum>
                    <maximum>0x3FF</maximum>
                  </range>
                </writeConstraint>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>HW</name>
                    <description>HW pixels. The valid range is 0x000 to 0x3FF. </description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>2</dim>
            <dimIncrement>0x8</dimIncrement>
            <dimIndex>A,B</dimIndex>
            <name>STH%s2</name>
            <description>TCON Horizontal Timing Setting Register STH%s2</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HSSEL</name>
                <description>STHx signal generation reference timing control.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Reference timing is the offset set with the TCON_TIM.OFFSET[10:0] (horizontal synchronization generation reference timing) field</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Reference timing is the input horizontal synchronization signal (HSIN)</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INV</name>
                <description>STVx signal polarity inversion control.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Inverted</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Not inverted</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEL</name>
                <description>Output signal select control for LCD_TCON2 (controlled by TCON_STHA2 register)/LCD_TCON3 (controlled by the TCON_STHB2 register) pin.</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>111</name>
                    <description>DE</description>
                    <value>#111</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>110</name>
                    <description>Setting prohibited</description>
                    <value>#110</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>101</name>
                    <description>Setting prohibited</description>
                    <value>#101</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>100</name>
                    <description>Setting prohibited</description>
                    <value>#100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>011</name>
                    <description>STHB</description>
                    <value>#011</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>010</name>
                    <description>STHA</description>
                    <value>#010</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>001</name>
                    <description>STVB</description>
                    <value>#001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>000</name>
                    <description>STVA</description>
                    <value>#000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DE</name>
            <description>TCON Data Enable Polarity Setting Register</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INV</name>
                <description>DE signal polarity inversion control.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Inverted</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Not inverted</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SYSCNT</name>
          <description>GLCDC System Control Registers</description>
          <addressOffset>0x1440</addressOffset>
          <register>
            <name>DTCTEN</name>
            <description>System control block State Detection Control Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>L2UNDFDTC</name>
                <description>Graphics 2 underflow detection control</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables detection.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables detection.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L1UNDFDTC</name>
                <description>Graphics 1 underflow detection control</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables detection.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables detection.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VPOSDTC</name>
                <description>Specified line detection control</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables detection.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables detection.</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTEN</name>
            <description>System control block Interrupt Request Enable Control Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>L2UNDFINTEN</name>
                <description>Interrupt request signal GLCDC_L2UNDF enable control.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables GLCDC_L2UNDF output</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables GLCDC_L2UNDF output</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L1UNDFINTEN</name>
                <description>Interrupt request signal GLCDC_L1UNDF enable control.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables GLCDC_L1UNDF output</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables GLCDC_L1UNDF output</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VPOSINTEN</name>
                <description>Interrupt request signal GLCDC_VPOS enable control.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Enables GLCDC_VPOS output</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Disables GLCDC_VPOS output</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>STCLR</name>
            <description>System control block Status Clear Register</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>L2UNDFCLR</name>
                <description>Graphics 2 underflow detection flag clear field</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Clears the graphics 2 underflow detection flag.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>L1UNDFCLR</name>
                <description>Graphics 1 underflow detection flag clear field</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Clears the graphics 1 underflow detection flag.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VPOSCLR</name>
                <description>Graphics 2 specified line detection flag clear field</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Clears the specified line detection flag.</description>
                    <value>#1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No operation</description>
                    <value>#0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
