felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>GTPSR</name>
          <description>General PWM Timer Stop Source Select Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSTOP</name>
              <description>Software Source Counter Stop Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable by the GTSTP register</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable by the GTSTP register</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>A,B,C,D,E,F,G,H</dimIndex>
              <name>PSELC%s</name>
              <description>ELC_GPTA Event Source Counter Stop Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the ELC_GPTA input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the ELC_GPTA input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCBFAH</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Stop Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCBFAL</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Stop Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCBRAH</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Stop Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCBRAL</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Stop Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCAFBH</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Stop Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCAFBL</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Stop Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCARBH</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Stop Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSCARBL</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Stop Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>PSGTRG%sF</name>
              <description>GTETRG Pin Falling Input Source Counter Stop Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the falling edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the falling edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>PSGTRG%sR</name>
              <description>GTETRG Pin Rising Input Source Counter Stop Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter stop is disable at the rising edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter stop is enable at the rising edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTCSR</name>
          <description>General PWM Timer Clear Source Select Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCLR</name>
              <description>Software Source Counter Clear Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable by the GTCLR register</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable by the GTCLR register</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>8</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>A,B,C,D,E,F,G,H</dimIndex>
              <name>CSELC%s</name>
              <description>ELC_GPTA Event Source Counter Clear Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the ELC_GPTA input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the ELC_GPTA input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCBFAH</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Clear Enable</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the falling edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCBFAL</name>
              <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Clear Enable</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the falling edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCBRAH</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Clear Enable</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the rising edge of GTIOCB input when GTIOCA input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCBRAL</name>
              <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Clear Enable</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the rising edge of GTIOCB input when GTIOCA input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCAFBH</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Clear Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the falling edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCAFBL</name>
              <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Clear Enable</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the falling edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCARBH</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Clear Enable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the rising edge of GTIOCA input when GTIOCB input is 1</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSCARBL</name>
              <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Clear Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the rising edge of GTIOCA input when GTIOCB input is 0</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>CSGTRG%sF</name>
              <description>GTETRG Pin Falling Input Source Counter Clear Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the falling edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the falling edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>2</dimIncrement>
              <dimIndex>A,B,C,D</dimIndex>
              <name>CSGTRG%sR</name>
              <description>GTETRG Pin Rising Input Source Counter Clear Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Counter clear is disable at the rising edge of GTETRG input</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Counter clear is enable at the rising edge of GTETRG input</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
