felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
                  <description>Initial output is Low. High output at cycle end. Output toggled at GTCCRA compare match.</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01100</name>
                  <description>Initial output is Low. Output toggled at cycle end. Output retained at GTCCRA compare match.</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01101</name>
                  <description>Initial output is Low. Output toggled at cycle end. Low output at GTCCRA compare match.</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01110</name>
                  <description>Initial output is Low. Output toggled at cycle end. High output at GTCCRA compare match.</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01111</name>
                  <description>Initial output is Low. Output toggled at cycle end. Output toggled at GTCCRA compare match.</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10000</name>
                  <description>Initial output is High. Output retained at cycle end. Output retained at GTCCRA compare match.</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10001</name>
                  <description>Initial output is High. Output retained at cycle end. Low output at GTCCRA compare match.</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>Initial output is High. Output retained at cycle end. High output at GTCCRA compare match.</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10011</name>
                  <description>Initial output is High. Output retained at cycle end. Output toggled at GTCCRA compare match.</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10100</name>
                  <description>Initial output is High. Low output at cycle end. Output retained at GTCCRA compare match.</description>
                  <value>#10100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10101</name>
                  <description>Initial output is High. Low output at cycle end. Low output at GTCCRA compare match.</description>
                  <value>#10101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10110</name>
                  <description>Initial output is High. Low output at cycle end. High output at GTCCRA compare match.</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10111</name>
                  <description>Initial output is High. Low output at cycle end. Output toggled at GTCCRA compare match.</description>
                  <value>#10111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11000</name>
                  <description>Initial output is High. High output at cycle end. Output retained at GTCCRA compare match.</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11001</name>
                  <description>Initial output is High. High output at cycle end. Low output at GTCCRA compare match.</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11010</name>
                  <description>Initial output is High. High output at cycle end. High output at GTCCRA compare match.</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11011</name>
                  <description>Initial output is High. High output at cycle end. Output toggled at GTCCRA compare match.</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11100</name>
                  <description>Initial output is High. Output toggled at cycle end. Output retained at GTCCRA compare match.</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11101</name>
                  <description>Initial output is High. Output toggled at cycle end. Low output at GTCCRA compare match.</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11110</name>
                  <description>Initial output is High. Output toggled at cycle end. High output at GTCCRA compare match.</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11111</name>
                  <description>Initial output is High. Output toggled at cycle end. Output toggled at GTCCRA compare match.</description>
                  <value>#11111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTINTAD</name>
          <description>General PWM Timer Interrupt Output Setting Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRPABL</name>
              <description>Same Time Output Level Low Disable Request Enable</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Same time output level low disable request is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Same time output level low disable request is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRPABH</name>
              <description>Same Time Output Level High Disable Request Enable</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Same time output level high disable request is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Same time output level high disable request is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRPDTE</name>
              <description>Dead Time Error Output Disable Request Enable</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable dead time error output disable request</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable dead time error output disable request</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRP</name>
              <description>Output Disable Source Select</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Group A output disable request</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Group B output disable request</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Group C output disable request</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Group D output disable request</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GTINTPC</name>
              <description>Period Count Function Finish Interrupt Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Interrupt request is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Interrupt request is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
