felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>GTICLF</name>
          <description>General PWM Timer Inter Channel Logical Operation Function Setting Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>ICLFA</name>
              <description>GTIOCnA Output Logical Operation Function Select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>A (no delay)</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>NOT A (no delay)</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>C (1PCLKGPT delay)</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>NOT C (1PCLKGPT delay)</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>A AND C (1PCLKGPT delay)</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>A OR C (1PCLKGPT delay)</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>A EXOR C (1PCLKGPT delay)</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>A NOR C (1PCLKGPT delay)</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICLFSELC</name>
              <description>Inter Channel Signal C Select</description>
              <lsb>4</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>GTIOC0A</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x01</name>
                  <description>GTIOC0B</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>GTIOC1A</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x03</name>
                  <description>GTIOC1B</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>GTIOC2A</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>GTIOC2B</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>GTIOC3A</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>GTIOC3B</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>GTIOC4A</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>GTIOC4B</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>GTIOC5A</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>GTIOC5B</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>GTIOC6A</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>GTIOC6B</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>GTIOC7A</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>GTIOC7B</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>GTIOC8A</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>GTIOC8B</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>GTIOC9A</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x13</name>
                  <description>GTIOC9B</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICLFB</name>
              <description>GTIOCnB Output Logical Operation Function Select</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>B (no delay)</description>
                  <value>#000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>NOT B (no delay)</description>
                  <value>#001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>D (1PCLKGPT delay)</description>
                  <value>#010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>NOT D (1PCLKGPT delay)</description>
                  <value>#011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>B AND D (1PCLKGPT delay)</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>B OR D (1PCLKGPTn delay)</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>B EXOR D (1PCLKGPT delay)</description>
                  <value>#110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>111</name>
                  <description>B NOR D (1PCLKGPT delay)</description>
                  <value>#111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICLFSELD</name>
              <description>Inter Channel Signal D Select</description>
              <lsb>20</lsb>
              <msb>25</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0x00</name>
                  <description>GTIOC0A</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x01</name>
                  <description>GTIOC0B</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x02</name>
                  <description>GTIOC1A</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x03</name>
                  <description>GTIOC1B</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x04</name>
                  <description>GTIOC2A</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x05</name>
                  <description>GTIOC2B</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x06</name>
                  <description>GTIOC3A</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x07</name>
                  <description>GTIOC3B</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x08</name>
                  <description>GTIOC4A</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x09</name>
                  <description>GTIOC4B</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0A</name>
                  <description>GTIOC5A</description>
                  <value>0x0a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0B</name>
                  <description>GTIOC5B</description>
                  <value>0x0b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0C</name>
                  <description>GTIOC6A</description>
                  <value>0x0c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0D</name>
                  <description>GTIOC6B</description>
                  <value>0x0d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0E</name>
                  <description>GTIOC7A</description>
                  <value>0x0e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x0F</name>
                  <description>GTIOC7B</description>
                  <value>0x0f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x10</name>
                  <description>GTIOC8A</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x11</name>
                  <description>GTIOC8B</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x12</name>
                  <description>GTIOC9A</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0x13</name>
                  <description>GTIOC9B</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTPC</name>
          <description>General PWM Timer Period Count Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>PCEN</name>
              <description>Period Count Function Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Period count function is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Period count function is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASTP</name>
              <description>Automatic Stop Function Enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Automatic stop function is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Automatic stop function is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCNT</name>
              <description>Period Counter</description>
              <lsb>16</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTSECSR</name>
          <description>General PWM Timer Operation Enable Bit Simultaneous Control Channel Select Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>SECSEL0</name>
              <description>Channel 0 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL1</name>
              <description>Channel 1 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL2</name>
              <description>Channel 2 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL3</name>
              <description>Channel 3 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL4</name>
              <description>Channel 4 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL5</name>
              <description>Channel 5 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL6</name>
              <description>Channel 6 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL7</name>
              <description>Channel 7 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL8</name>
              <description>Channel 8 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECSEL9</name>
              <description>Channel 9 Operation Enable Bit Simultaneous Control Channel Select</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous control</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable simultaneous control</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
