felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>GTSECR</name>
          <description>General PWM Timer Operation Enable Bit Simultaneous Control Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>SBDCE</name>
              <description>GTCCR Register Buffer Operation Simultaneous Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous enabling GTCCR buffer operations</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable GTCCR register buffer operations simultaneously</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBDPE</name>
              <description>GTPR Register Buffer Operation Simultaneous Enable</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous enabling GTPR buffer operations</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable GTPR register buffer operations simultaneously</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBDCD</name>
              <description>GTCCR Register Buffer Operation Simultaneous Disable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous disabling GTCCR buffer operations</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disable GTCCR register buffer operations simultaneously</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBDPD</name>
              <description>GTPR Register Buffer Operation Simultaneous Disable</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous disabling GTPR buffer operations</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disable GTPR register buffer operations simultaneously</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPCE</name>
              <description>Period Count Function Simultaneous Enable</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous enabling period count function</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable period count function simultaneously</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPCD</name>
              <description>Period Count Function Simultaneous Disable</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable simultaneous disabling period count function</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disable period count function simultaneously</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT1</name>
      <baseAddress>0x40078100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT2</name>
      <baseAddress>0x40078200</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT3</name>
      <baseAddress>0x40078300</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT4</name>
      <baseAddress>0x40078400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT5</name>
      <baseAddress>0x40078500</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT6</name>
      <baseAddress>0x40078600</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT7</name>
      <baseAddress>0x40078700</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT8</name>
      <baseAddress>0x40078800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT9</name>
      <baseAddress>0x40078900</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT10</name>
      <baseAddress>0x40078A00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT11</name>
      <baseAddress>0x40078B00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT12</name>
      <baseAddress>0x40078C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_GPT0">
      <name>R_GPT13</name>
      <baseAddress>0x40078D00</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_GPT_ODC</name>
      <description>PWM Delay Generation Circuit</description>
      <baseAddress>0x4007B000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x004</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000018</offset>
        <size>0x020</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>GTDLYR[%s]</name>
          <description>PWM DELAY RISING</description>
          <addressOffset>0x18</addressOffset>
          <register>
            <name>A</name>
            <description>GTIOCA Output Delay Register</description>
            <addressOffset>0</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DLY</name>
                <description>GTIOCnA Output Rising Edge Delay Setting</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00000</name>
                    <description>No delay on rising edges</description>
                    <value>#00000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Delay of DLY/32 times the PCLKD period is applied.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>B</name>
            <description>GTIOCB Output Delay Register</description>
            <addressOffset>2</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DLY</name>
                <description>GTIOCnA Output Rising Edge Delay Setting</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00000</name>
                    <description>No delay on rising edges</description>
                    <value>#00000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>others</name>
                    <description>Delay of DLY/32 times the PCLKD period is applied.</description>
                    <isDefault>true</isDefault>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster derivedFrom="GTDLYR[%s]">
          <name>GTDLYF[%s]</name>
          <description>PWM DELAY FALLING</description>
          <addressOffset>0x28</addressOffset>
        </cluster>
        <register>
          <name>GTDLYCR1</name>
          <description>PWM Output Delay Control Register1</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DLLMOD</name>
              <description>DLL Mode Select</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>5 bit-mode</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>4 bit-mode</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLYRST</name>
              <description>PWM Delay Generation Circuit Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal operation</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Reset</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLLEN</name>
              <description>DLL Operation Enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DLL operation is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DLL operation is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTDLYCR2</name>
          <description>PWM Output Delay Control Register2</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <dim>1</dim>
              <dimIncrement>1</dimIncrement>
              <name>DLYDENB%s</name>
              <description>PWM Delay Generation Circuit Disenable for GTIOCB</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Delay generation circuit of GTIOCB is based on DLYEN1.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Delay generation circuit of GTIOCB is disabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>1</dim>
              <dimIncrement>1</dimIncrement>
              <name>DLYEN%s</name>
              <description>PWM Delay Generation Circuit enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Delay generation circuit of channel is enabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Delay generation circuit of channel is disabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>1</dimIncrement>
              <name>DLYBS%s</name>
              <description>PWM Delay Generation Circuit bypass</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Delay generation circuit of channel is bypassed.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Delay generation circuit of channel is not bypassed.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
