felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="R_IIC0">
      <name>R_IIC1</name>
      <baseAddress>0x40053100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="R_IIC0">
      <name>R_IIC2</name>
      <baseAddress>0x40053200</baseAddress>
    </peripheral>
    <peripheral>
      <name>R_IRDA</name>
      <description>IrDA Interface</description>
      <baseAddress>0x40070F00</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IRCR</name>
          <description>IrDA Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>IRE</name>
              <description>IrDA Enable</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Serial I/O pins are used for normal serial communication.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Serial I/O pins are used for IrDA data communication.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRTXINV</name>
              <description>IRTXD Polarity Switching </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Data to be transmitted is output to IRTXD as is.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Data to be transmitted is output to IRTXD after the polarity is inverted.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRRXINV</name>
              <description>IRRXD Polarity Switching</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>IRRXD input is used as received data as is.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>IRRXD input is used as received data after the polarity is inverted.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>R_IWDT</name>
      <description>Independent Watchdog Timer</description>
      <baseAddress>0x40044400</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000004</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IWDTRR</name>
          <description>IWDT Refresh Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>IWDTRR</name>
              <description>The counter is refreshed by writing 0x00 and then writing 0xFF to this register.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWDTSR</name>
          <description>IWDT Status Register</description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REFEF</name>
              <description>Refresh Error Flag</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Refresh error not occurred</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Refresh error occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNDFF</name>
              <description>Underflow Flag</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Underflow not occurred</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Underflow occurred</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTVAL</name>
              <description>Counter ValueValue counted by the counter</description>
              <lsb>0</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
