felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_MPU_SMPU</name>
      <description>Bus Slave MPU</description>
      <baseAddress>0x40000C00</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000010</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000014</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000018</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000001C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000020</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000024</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000028</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000002C</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000030</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000034</offset>
        <size>0x02</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>10</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimArrayIndex>
            <enumeratedValue>
              <name>MBIU</name>
              <description>MBIU</description>
              <value>0</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>FBIU</name>
              <description>FBIU</description>
              <value>1</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>R_SRAM</name>
              <description>R_SRAM</description>
              <value>2</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>SRAM1</name>
              <description>SRAM1</description>
              <value>3</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P0BIU</name>
              <description>P0BIU</description>
              <value>4</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P2BIU</name>
              <description>P2BIU</description>
              <value>5</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>P6BIU</name>
              <description>P6BIU</description>
              <value>6</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>B7BIU</name>
              <description>B7BIU</description>
              <value>7</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>EXBIU</name>
              <description>EXBIU</description>
              <value>8</value>
            </enumeratedValue>
            <enumeratedValue>
              <name>EXBIU2</name>
              <description>EXBIU2</description>
              <value>9</value>
            </enumeratedValue>
          </dimArrayIndex>
          <name>SMPU[%s]</name>
          <description>Access Control Structure for MBIU</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>R</name>
            <description>Access Control Register for MBIU</description>
            <addressOffset>0x00</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x2000</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>WPSRAMHS</name>
                <description>SRAMHS Write Protection</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for SRAMHS writes from master group A, B, and C disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for SRAMHS writes from master group A, B, and C enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPSRAMHS</name>
                <description>SRAMHS Read Protection</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for SRAMHS reads from master group A, B, and C disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for SRAMHS reads from master group A, B, and C enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WPFLI</name>
                <description>Code Flash Memory Write Protection (Note: This bit is read as 1. The write value should be 1.)</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Setting prohibited</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for code flash memory writes from master group A, B, and C enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPFLI</name>
                <description>Code Flash Memory Read Protection</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for code flash memory reads from master group A, B, and C disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for code flash memory reads from master group A, B, and C enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WPGRPC</name>
                <description>Master Group C Write protection</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for master group C writes disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for master group C writes enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPGRPC</name>
                <description>Master Group C Read protection</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for master group C reads disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for master group C reads enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WPGRPB</name>
                <description>Master Group B Write protection</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for master group B writes disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for master group B writes enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPGRPB</name>
                <description>Master Group B Read protection</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for master group B reads disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for master group B reads enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WPGRPA</name>
                <description>Master Group A Write protection</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for master group A writes disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for master group A writes enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RPGRPA</name>
                <description>Master Group A Read protection</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>Memory protection for master group A reads disabled</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>Memory protection for master group A reads enabled.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SMPUCTL</name>
          <description>Slave MPU Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key Code This bit is used to enable or disable rewriting of the PROTECT and OAD bit.</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0xA5</name>
                  <description>Writing to the PROTECT and OAD bit is valid, when the KEY bits are written 0xA5.</description>
                  <value>0xA5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Writing to the  PROTECT and OAD bit is invalid.</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROTECT</name>
              <description>Protection of register </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>All Bus Slave register writing is possible.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>All Bus Slave register writing is protected. Read is possible.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OAD</name>
              <description>Master Group enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Non-maskable interrupt.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Internal reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
