felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>R_RTC</name>
      <description>Realtime Clock</description>
      <baseAddress>0x40044000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000002</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000004</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000006</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000008</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000000A</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000000C</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000000E</offset>
        <size>0x003</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000012</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000014</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000016</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000018</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000001A</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000001C</offset>
        <size>0x003</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000022</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000024</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000028</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000002A</offset>
        <size>0x005</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000040</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000042</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000044</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000052</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000054</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000056</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000005A</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000005C</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000062</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000064</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000066</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000006A</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000006C</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000072</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000074</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x00000076</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000007A</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x0000007C</offset>
        <size>0x01</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>RTCCR[%s]</name>
          <description>Time Capture Control Register</description>
          <addressOffset>0x40</addressOffset>
          <register>
            <name>RTCCR</name>
            <description>Time Capture Control Register</description>
            <addressOffset>0</addressOffset>
            <size>8</size>
            <access>read-write</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>TCNF</name>
                <description>Time Capture Noise Filter Control</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>The noise filter is off.</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Setting prohibited</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>The noise filter is on (count source).</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>The noise filter is on (count source by divided by 32).</description>
                    <value>#11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCST</name>
                <description>Time Capture Status</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>No event is detected.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>An event is detected.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TCCT</name>
                <description>Time Capture Control</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>00</name>
                    <description>No event is detected.</description>
                    <value>#00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>01</name>
                    <description>Rising edge is detected.</description>
                    <value>#01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>10</name>
                    <description>Falling edge is detected.</description>
                    <value>#10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>11</name>
                    <description>Both edges are detected.</description>
                    <value>#11</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CP[%s]</name>
          <description>Capture registers</description>
          <addressOffset>0x50</addressOffset>
          <register>
            <name>RSEC</name>
            <description>Second Capture Register</description>
            <addressOffset>0x02</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>SEC10</name>
                <description>10-Second Capture Capture value for the tens place of seconds</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SEC1</name>
                <description>1-Second Capture Capture value for the ones place of seconds</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BCNT0</name>
            <description>BCNT0 Capture Register</description>
            <alternateRegister>RSEC</alternateRegister>
            <addressOffset>0x02</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>BCNT0CP</name>
                <description>BCNT0CP is a read-only register that captures the BCNT0 value when a time capture event is detected.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RMIN</name>
            <description>Minute Capture Register</description>
            <addressOffset>0x04</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>MIN10</name>
                <description>10-Minute Capture Capture value for the tens place of minutes</description>
                <lsb>4</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MIN1</name>
                <description>1-Minute Capture Capture value for the ones place of minutes</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BCNT1</name>
            <description>BCNT1 Capture Register</description>
            <alternateRegister>RMIN</alternateRegister>
            <addressOffset>0x04</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>BCNT1CP</name>
                <description>BCNT1CP is a read-only register that captures the BCNT1 value when a time capture event is detected.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RHR</name>
            <description>Hour Capture Register</description>
            <addressOffset>0x06</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>PM</name>
                <description>A.m./p.m. select for time counter setting.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>0</name>
                    <description>a.m.</description>
                    <value>#0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1</name>
                    <description>p.m.</description>
                    <value>#1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HR10</name>
                <description>10-Minute Capture Capture value for the tens place of minutes</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>HR1</name>
                <description>1-Minute Capture Capture value for the ones place of minutes</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BCNT2</name>
            <description>BCNT2 Capture Register</description>
            <alternateRegister>RHR</alternateRegister>
            <addressOffset>0x06</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>BCNT2CP</name>
                <description>BCNT2CP is a read-only register that captures the BCNT2 value when a time capture event is detected.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RDAY</name>
            <description>Date Capture Register</description>
            <addressOffset>0x0A</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>DATE10</name>
                <description>10-Day Capture Capture value for the tens place of minutes</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATE1</name>
                <description>1-Day Capture Capture value for the ones place of minutes</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BCNT3</name>
            <description>BCNT3 Capture Register</description>
            <alternateRegister>RDAY</alternateRegister>
            <addressOffset>0x0A</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>BCNT3CP</name>
                <description>BCNT3CP is a read-only register that captures the BCNT3 value when a time capture event is detected.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RMON</name>
            <description>Month Capture Register</description>
            <addressOffset>0x0C</addressOffset>
            <size>8</size>
            <access>read-only</access>
            <resetValue>0x00</resetValue>
            <resetMask>0x00</resetMask>
            <fields>
              <field>
                <name>MON10</name>
                <description>10-Month Capture Capture value for the tens place of months</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MON1</name>
                <description>1-Month Capture Capture value for the ones place of months</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>R64CNT</name>
          <description>64-Hz Counter</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x80</resetMask>
          <fields>
            <field>
              <name>F1HZ</name>
              <description>1Hz</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>F2HZ</name>
              <description>2Hz</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>F4HZ</name>
              <description>4Hz</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>F8HZ</name>
              <description>8Hz</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>F16HZ</name>
              <description>16Hz</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>F32HZ</name>
              <description>32Hz</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>F64HZ</name>
              <description>64Hz</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSECCNT</name>
          <description>Second Counter</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <fields>
            <field>
              <name>SEC10</name>
              <description>10-Second Count Counts from 0 to 5 for 60-second counting.</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC1</name>
              <description>1-Second Count Counts from 0 to 9 every second. When a carry is generated, 1 is added to the tens place.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT0</name>
          <description>Binary Counter 0</description>
          <alternateRegister>RSECCNT</alternateRegister>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <fields>
            <field>
              <name>BCNT0</name>
              <description>The BCNT0 counter is a readable/writable 32-bit binary counter b7 to b0.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMINCNT</name>
          <description>Minute Counter</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <fields>
            <field>
              <name>MIN10</name>
              <description>10-Minute Count Counts from 0 to 5 for 60-minute counting.</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN1</name>
              <description>1-Minute Count Counts from 0 to 9 every minute. When a carry is generated, 1 is added to the tens place.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCNT1</name>
          <description>Binary Counter 1</description>
          <alternateRegister>RMINCNT</alternateRegister>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <fields>
            <field>
              <name>BCNT1</name>
              <description>The BCNT1 counter is a readable/writable 32-bit binary counter b15 to b8.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
