felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>VLCD</name>
          <description>LCD Boost Level Control Register </description>
          <addressOffset>0x003</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VLCD</name>
              <description>Reference Voltage(Contrast Adjustment) Select</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00100</name>
                  <description>Reference voltageselection(contrast adjustment):  1.00 V (default)  VL4 voltage:  3.00 V(1/3 bias method)/4.00 V(1/4 bias method)</description>
                  <value>#00100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00101</name>
                  <description>Reference voltageselection(contrast adjustment):  1.05 V  VL4 voltage:  3.15 V(1/3 bias method)/4.20 V(1/4 bias method)</description>
                  <value>#00101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00110</name>
                  <description>Reference voltageselection(contrast adjustment):  1.10 V  VL4 voltage:  3.30 V(1/3 bias method)/4.40 V(1/4 bias method)</description>
                  <value>#00110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>00111</name>
                  <description>Reference voltageselection(contrast adjustment):  1.15 V   VL4 voltage:  3.45 V(1/3 bias method)/4.60 V(1/4 bias method)</description>
                  <value>#00111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01000</name>
                  <description>Reference voltageselection(contrast adjustment):  1.20 V  VL4 voltage:  3.60 V(1/3 bias method)/4.80 V(1/4 bias method)</description>
                  <value>#01000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01001</name>
                  <description>Reference voltageselection(contrast adjustment):  1.25 V  VL4 voltage:  3.75 V(1/3 bias method)/5.00 V(1/4 bias method)</description>
                  <value>#01001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01010</name>
                  <description>Reference voltageselection(contrast adjustment):  1.30 V  VL4 voltage:  3.90 V(1/3 bias method)/5.20 V(1/4 bias method)</description>
                  <value>#01010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01011</name>
                  <description>Reference voltageselection(contrast adjustment):  1.35 V  VL4 voltage:  4.05 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#01011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01100</name>
                  <description>Reference voltageselection(contrast adjustment):  1.40 V  VL4 voltage:  4.20 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#01100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01101</name>
                  <description>Reference voltageselection(contrast adjustment):  1.45 V  VL4 voltage:  4.35 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#01101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01110</name>
                  <description>Reference voltageselection(contrast adjustment):  1.50 V  VL4 voltage:  4.50 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#01110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01111</name>
                  <description>Reference voltageselection(contrast adjustment):  1.55 V  VL4 voltage:  4.65 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#01111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10000</name>
                  <description>Reference voltageselection(contrast adjustment):  1.60 V   VL4 voltage:  4.80 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10001</name>
                  <description>Reference voltageselection(contrast adjustment):  1.65 V   VL4 voltage:  4.95 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10010</name>
                  <description>Reference voltageselection(contrast adjustment):  1.70 V   VL4 voltage:  5.10 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#10010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10011</name>
                  <description>Reference voltageselection(contrast adjustment):  1.75 V   VL4 voltage:  5.25 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                  <value>#10011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>others</name>
                  <description>Setting prohibited</description>
                  <isDefault>true</isDefault>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>SEG[%s]</name>
          <description>LCD Display Data Array</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>A</name>
              <description>A-Pattern Area</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>B</name>
              <description>B-Pattern Area</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
