felipe-iar/wolfssl/IDE/IAR-EWARM/Projects/benchmark_RA6M3/ra/fsp/src/bsp/cmsis/Device/RENESAS/SVD/RA.svd
        <register>
          <name>SSISR</name>
          <description>Status Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x02000013</resetValue>
          <resetMask>0x3E00007F</resetMask>
          <fields>
            <field>
              <name>TUIRQ</name>
              <description>Transmit Underflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No transmit underflow has occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A transmit underflow has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOIRQ</name>
              <description>Transmit Overflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No transmit overflow has occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A transmit overflow has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUIRQ</name>
              <description>Receive Underflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No receive underflow has occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A receive underflow has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROIRQ</name>
              <description>Receive Overflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No receive overflow has occurred.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A receive overflow has occurred.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IIRQ</name>
              <description>Idle Mode Interrupt Status Flag</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>This module is not in idle state.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>This module is in idle state.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCHNO</name>
              <description>Transmit Channel Number</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TSWNO</name>
              <description>Transmit Serial Word Number</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RCHNO</name>
              <description>Receive Channel Number.These bits are read as 00b.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RSWNO</name>
              <description>Receive Serial Word Number</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IDST</name>
              <description>Idle Mode Status Flag</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Serial bus is operating.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The current communication is stopped.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIFCR</name>
          <description>FIFO Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUCKE</name>
              <description>Oversampling Clock Enable</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>The oversampling clock is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The oversampling clock is enabled.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSIRST</name>
              <description>SSI soft ware reset</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clears the SSI software reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>initiates the SSI software reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TTRG</name>
              <description>Transmit Data Trigger Number NOTE: The values in parenthesis are the number of empty stages in SSIFTDR at which the TDE flag is set.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>7 (1)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>6 (2)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>4 (4)</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>2 (6)</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTRG</name>
              <description>Receive Data Trigger Number</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>1</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>2</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>4</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>6</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIE</name>
              <description>Transmit Interrupt Enable NOTE: TXI can be cleared by clearing either the TDE flag (see the description of the TDE bit for details) or TIE bit.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Transmit data empty interrupt (TXI) request is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Transmit data empty interrupt (TXI) request is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIE</name>
              <description>Receive Interrupt Enable NOTE: RXI can be cleared by clearing either the RDF flag (see the description of the RDF bit for details) or RIE bit.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Receive data full interrupt (RXI) request is disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Receive data full interrupt (RXI) request is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFRST</name>
              <description>Transmit FIFO Data Register Reset</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clears the transmit data FIFO reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Initiates the transmit data FIFO reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFRST</name>
              <description>Receive FIFO Data Register Reset</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Clears the receive data FIFO reset.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Initiates the receive data FIFO reset.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSW</name>
              <description>Byte Swap Enable</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables byte swap</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables byte swap</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIFSR</name>
          <description>FIFO Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDC</name>
              <description>Transmit Data Indicate Flag(Indicates the number of data units stored in SSIFTDR)</description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TDE</name>
              <description>Transmit Data Empty Flag NOTE: Since the SSIFTDR register is a 32-byte FIFO register, the maximum number of bytes that can be written to it while the TDE flag is 1 is 8 - TDC[3:0]. If writing data to the SSIFTDR register is continued after all the data is written, writing will be invalid and an overflow occurs.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Number of data bytes for transmission in SSIFTDR is greater than the set transmit trigger number.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Number of data bytes for transmission in SSIFTDR is equal to or less than the set transmit trigger number.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDC</name>
              <description>Receive Data Indicate Flag(Indicates the number of data units stored in SSIFRDR)</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RDF</name>
              <description>Receive Data Full Flag NOTE:  Since the SSIFRDR register is a 32-byte FIFO register, the maximum number of data bytes that can be read from it while the RDF flag is 1 is indicated in the RDC[3:0] flags. If reading data from the SSIFRDR register is continued after all the data is read, undefined values will be read.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <readAction>modify</readAction>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Number of received data bytes in SSIFRDR is less than the set receive trigger number.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Number of received data bytes in SSIFRDR is equal to or greater than the set receive trigger number.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIFTDR</name>
          <description>Transmit FIFO Data Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SSIFTDR</name>
              <description>SSIFTDR is a write-only FIFO register consisting of eight stages of 32-bit registers for storing data to be serially transmitted.  NOTE: that when the SSIFTDR register is full of data (32 bytes), the next data cannot be written to it. If writing is attempted, it will be ignored and an overflow occurs.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIFTDR16</name>
          <description>Transmit FIFO Data Register</description>
          <alternateRegister>SSIFTDR</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <register>
          <name>SSIFTDR8</name>
          <description>Transmit FIFO Data Register</description>
          <alternateRegister>SSIFTDR</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <register>
          <name>SSIFRDR</name>
          <description>Receive FIFO Data Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SSIFRDR</name>
              <description>SSIFRDR is a read-only FIFO register consisting of eight stages of 32-bit registers for storing serially received data.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSIFRDR16</name>
          <description>Receive FIFO Data Register</description>
          <alternateRegister>SSIFRDR</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <register>
          <name>SSIFRDR8</name>
          <description>Receive FIFO Data Register</description>
          <alternateRegister>SSIFRDR</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
